/****************************************************************************************************
 * src/in-memory-data.service.ts
 *    メッセージに関するデータ管理を行うサービス
 ****************************************************************************************************/

/* --------------------------------------------------------------------------------------------------
 * import構文
 *    import { インポートするクラス as 別名 } from 'インポート元モジュール';
 * ------------------------------------------------------------------------------------------------ */

/* --------------------------------------------------------------------------------------------------
 * InMemoryDbService
 *    DBサーバーの代用となるサービスクラス
 * ------------------------------------------------------------------------------------------------ */
import { InMemoryDbService } from 'angular-in-memory-web-api';

/* --------------------------------------------------------------------------------------------------
 * クラス定義
 *    export class クラス名 { }
 *    ※exportを付けると、他クラスから参照(import)可能となる
 * ------------------------------------------------------------------------------------------------ */

export class InMemoryDataService implements InMemoryDbService {
    createDb() {
        const technologies = [
            {id: 11, name: 'Java',       remark: '1.4,5,6,7,8'},
            {id: 12, name: 'C#',         remark: ''},
            {id: 13, name: 'Ruby',       remark: '2.5'},
            {id: 14, name: 'HTML',       remark: '4,5'},
            {id: 15, name: 'CSS',        remark: '2,3'},
            {id: 16, name: 'JavaScript', remark: ''},
            {id: 17, name: 'TypeScript', remark: ''}
        ];

        return  {technologies};
    }
}
