/****************************************************************************************************
 * src/main.ts
 *    Angular アプリを起動するためのスタートアップコード
 ****************************************************************************************************/

/* --------------------------------------------------------------------------------------------------
 * import構文
 *    import { インポートするクラス as 別名 } from 'インポート元モジュール';
 * ------------------------------------------------------------------------------------------------ */

// ライブラリーからのインポート(ダイレクト記載)
import { enableProdMode } from '@angular/core';
import { platformBrowserDynamic } from '@angular/platform-browser-dynamic';

// ローカルファイルのインポート(相対パス記載)
import { AppModule } from './app/app.module';
import { environment } from './environments/environment';

if (environment.production) {
  // 本番環境である場合
  enableProdMode();
}

/* --------------------------------------------------------------------------------------------------
 * catch構文
 *    メソッド().catch( 引数 => 例外処理 );
 * ------------------------------------------------------------------------------------------------ */

// 初期起動モジュールの指定
platformBrowserDynamic().bootstrapModule(AppModule)
  .catch(err => console.error(err));
